# pandas - dataframe

In [1]:
import pandas as pd
import numpy as np

syntax 
pd.DataFrame(values, index, columns)

In [2]:
df = pd.DataFrame(np.arange(1,26).reshape(5,5))
df

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [3]:
df1 = pd.DataFrame(np.arange(1,26).reshape(5,5),index=list('abcde'),columns=['c1','c2','c3','c4','c5'])
df1

   c1  c2  c3  c4  c5
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [4]:
df1.shape #to check size of data frame (rows, columns)

(5, 5)

In [5]:
df1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
df1.columns

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [7]:
df2 = pd.DataFrame({'c1' : [1,2,3,4,5], 'c2' : list('abcde'), 'c3' : list('54321')})  #creating dataframe usig dictionary
df2

   c1 c2 c3
0   1  a  5
1   2  b  4
2   3  c  3
3   4  d  2
4   5  e  1

In [8]:
df3 = {'Rank' : list('12345'), 'Team' : ['Dallas Cowboys','green Bay Packers','Baltimore Ravens','New England Patriots','Chicago Bears'], 'GP' : [964,1418,434,966,1452], 'Won' : [550,790,243,537,786], 'Lost' : [408,590,190,420,624], 'Tied' : [6,38,1,9,42], 'Pct.' : [0.574,0.571,0.561,0.561,0.556], 'First NFL Season' : [1960,1921,1996,1960,1920], 'Division' : ['NFC East','NFC North','AFC North','AFC East','NFC North'] }

In [9]:
pd.DataFrame(df3)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,964,550,408,6,0.574,1960,NFC East
1,2,green Bay Packers,1418,790,590,38,0.571,1921,NFC North
2,3,Baltimore Ravens,434,243,190,1,0.561,1996,AFC North
3,4,New England Patriots,966,537,420,9,0.561,1960,AFC East
4,5,Chicago Bears,1452,786,624,42,0.556,1920,NFC North

In [10]:
pd.Series(list('abcde'))

0    a
1    b
2    c
3    d
4    e
dtype: object

In [11]:
pd.Series(list('abcde'),index=[1,2,3,4,5])

1    a
2    b
3    c
4    d
5    e
dtype: object

In [12]:
a=pd.Series(['Saket','Nikhil','Ajay','Om','Ganesh'],index=['Emp id 1','Emp id 2','Emp id 3','Emp id 4','Emp id 5'])
a

Emp id 1     Saket
Emp id 2    Nikhil
Emp id 3      Ajay
Emp id 4        Om
Emp id 5    Ganesh
dtype: object

In [13]:
a.index

Index(['Emp id 1', 'Emp id 2', 'Emp id 3', 'Emp id 4', 'Emp id 5'], dtype='object')

In [14]:
a.values

array(['Saket', 'Nikhil', 'Ajay', 'Om', 'Ganesh'], dtype=object)

In [15]:
a['Emp id 1']

'Saket'

In [16]:
ser=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
win = pd.DataFrame({'Rank' : list('12345'), 'Team' : ['Dallas Cowboys','green Bay Packers','Baltimore Ravens','New England Patriots','Chicago Bears'], 'GP' : [964,1418,434,966,1452], 'Won' : [550,790,243,537,786], 'Lost' : [408,590,190,420,624], 'Tied' : [6,38,1,9,42], 'Pct.' : [0.574,0.571,0.561,0.561,0.556], 'First NFL Season' : [1960,1921,1996,1960,1920], 'Division' : ['NFC East','NFC North','AFC North','AFC East','NFC North'] })

In [18]:
win=pd.read_clipboard()
#pd.read is use for getting the value from different soures
#ex: clipboard is use to get the data from copy paste

EmptyDataError: No columns to parse from file

In [ ]:
win

In [ ]:
win['Won'] #1st method

In [19]:
win.Won   #second method

0    550
1    790
2    243
3    537
4    786
Name: Won, dtype: int64

In [20]:
win[['Won','Team']]

   Won                  Team
0  550        Dallas Cowboys
1  790     green Bay Packers
2  243      Baltimore Ravens
3  537  New England Patriots
4  786         Chicago Bears

In [21]:

win['Stadium'] = np.NaN
win
#we can creae list if wanted to add list

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,964,550,408,6,0.574,1960,NFC East,NaN
1,2,green Bay Packers,1418,790,590,38,0.571,1921,NFC North,NaN
2,3,Baltimore Ravens,434,243,190,1,0.561,1996,AFC North,NaN
3,4,New England Patriots,966,537,420,9,0.561,1960,AFC East,NaN
4,5,Chicago Bears,1452,786,624,42,0.556,1920,NFC North,NaN

In [22]:
a=pd.Series(['wankhede','jamta'],index=[1,3])
a

1    wankhede
3       jamta
dtype: object

In [23]:
win['Stadium'] = a
win

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,964,550,408,6,0.574,1960,NFC East,NaN
1,2,green Bay Packers,1418,790,590,38,0.571,1921,NFC North,wankhede
2,3,Baltimore Ravens,434,243,190,1,0.561,1996,AFC North,NaN
3,4,New England Patriots,966,537,420,9,0.561,1960,AFC East,jamta
4,5,Chicago Bears,1452,786,624,42,0.556,1920,NFC North,NaN

# Loc and iloc

loc = it is the label based
Syntax :
    loc[rowlabel, columnlabel]

iloc = it is the integer position based
Syntax : 
    iloc[rowposition, columnposition]

In [24]:
win.loc[2,'Team']

'Baltimore Ravens'

In [25]:
win.loc[2:5,'Stadium']

2      NaN
3    jamta
4      NaN
Name: Stadium, dtype: object

In [26]:
win.iloc[2:5,2]

2     434
3     966
4    1452
Name: GP, dtype: int64

In [27]:
win.iloc[:,2:5]

     GP  Won  Lost
0   964  550   408
1  1418  790   590
2   434  243   190
3   966  537   420
4  1452  786   624

In [28]:
win.iloc[:-1,1:4]   #except last row everything will get printed

                   Team    GP  Won
0        Dallas Cowboys   964  550
1     green Bay Packers  1418  790
2      Baltimore Ravens   434  243
3  New England Patriots   966  537

In [29]:
win[win['Rank'] < 4]

TypeError: '<' not supported between instances of 'str' and 'int'

In [39]:
x=pd.Series([1,2,np.nan,np.nan,5,np.nan,7,8,np.nan])

In [40]:
x

0    1.0
1    2.0
2    NaN
3    NaN
4    5.0
5    NaN
6    7.0
7    8.0
8    NaN
dtype: float64

In [44]:
x.isnull().sum()  #tell all the null values in

4

In [47]:
x.notnull().sum() #tell all the sum of the values

5

In [49]:
x.fillna(method='ffill')   #it is a forward fill, and it fill the value up to down

0    1.0
1    2.0
2    2.0
3    2.0
4    5.0
5    5.0
6    7.0
7    8.0
8    8.0
dtype: float64

In [50]:
x.fillna(method='bfill')   #it is a backward fill, it fill the value from down to up

0    1.0
1    2.0
2    5.0
3    5.0
4    5.0
5    7.0
6    7.0
7    8.0
8    NaN
dtype: float64

In [51]:
x.dropna() #it will drop the all null value

0    1.0
1    2.0
4    5.0
6    7.0
7    8.0
dtype: float64

In [52]:
x  
#all the operation is done but no changes in the original variable so to make changes in the original variable we use implace

0    1.0
1    2.0
2    NaN
3    NaN
4    5.0
5    NaN
6    7.0
7    8.0
8    NaN
dtype: float64

In [54]:
x.dropna(inplace=True)  #it will drop all null value, and store in the original variable

In [55]:
x

0    1.0
1    2.0
4    5.0
6    7.0
7    8.0
dtype: float64

In [2]:
dict1={0:[1.0,np.nan,0.7,np.nan],1:[2.0,5.0,np.nan,np.nan],2:[3.0,6.0,9.0,np.nan]}
dict1

{0: [1.0, nan, 0.7, nan], 1: [2.0, 5.0, nan, nan], 2: [3.0, 6.0, 9.0, nan]}

In [3]:
df6=pd.DataFrame(dict1)
df6

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  0.7  NaN  9.0
3  NaN  NaN  NaN

In [4]:
df6.dropna(how="all") #it drop the whole row if all the values are null

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  0.7  NaN  9.0

In [5]:
df6.dropna(axis=1)  #it check the value from column to column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [6]:
df6.dropna(how='all',axis=1)
 # it drop the column, where there is all null value in the column in the dataframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  0.7  NaN  9.0
3  NaN  NaN  NaN

In [7]:
df6.dropna(thresh=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  0.7  NaN  9.0

In [8]:
df6.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  0.7  NaN  9.0

In [9]:
df6.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0

In [10]:
df6.dropna(thresh=3,axis=1)

     2
0  3.0
1  6.0
2  9.0
3  NaN

In [11]:
df6.dropna(subset=[0])

     0    1    2
0  1.0  2.0  3.0
2  0.7  NaN  9.0

In [12]:
df6.dropna(subset=[1])
#to get a particular column where there is no null value to we use subset
#in this we are getting the no null value of the lst column

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0

In [13]:
df6.dropna(subset=[2])

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  0.7  NaN  9.0

In [15]:
df6.dropna(subset=[0],axis=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  0.7  NaN  9.0
3  NaN  NaN  NaN

In [16]:
df6.dropna(subset=[1],axis=1)

     1    2
0  2.0  3.0
1  5.0  6.0
2  NaN  9.0
3  NaN  NaN

In [20]:
df6.dropna(subset=[2],axis=1)

     0    2
0  1.0  3.0
1  NaN  6.0
2  0.7  9.0
3  NaN  NaN

In [3]:
dff = pd.DataFrame({0 : [5,np.nan,7,np.nan,np.nan], 1 : [np.nan,6,np.nan,8,9]})

In [4]:
dff

     0    1
0  5.0  NaN
1  NaN  6.0
2  7.0  NaN
3  NaN  8.0
4  NaN  9.0

In [5]:
dff[0].isnull()

0    False
1     True
2    False
3     True
4     True
Name: 0, dtype: bool

In [6]:
dff['concat column']=np.where(dff[0].isnull(),dff[1],dff[0])

In [7]:
dff

     0    1  concat column
0  5.0  NaN            5.0
1  NaN  6.0            6.0
2  7.0  NaN            7.0
3  NaN  8.0            8.0
4  NaN  9.0            9.0

In [8]:
a=10
b=20

In [9]:
np.where(a<15,b,a)   #where(condition,true,false)

array(20)

# Merge

In [11]:
df7 = pd.DataFrame({'ds1' : [0,1,2,3,4,5], 'key1' : ['x','z','y','z','x','x']})

In [12]:
df7

   ds1 key1
0    0    x
1    1    z
2    2    y
3    3    z
4    4    x
5    5    x

In [17]:
df8 = pd.DataFrame({'ds2' : [1,2,3], 'key2' : ['q','y','z']})

In [18]:
df8

   ds2 key2
0    1    q
1    2    y
2    3    z

In [20]:
df9 = pd.merge(df7,df8,left_on='key1',right_on='key2')
df9

   ds1 key1  ds2 key2
0    1    z    3    z
1    3    z    3    z
2    2    y    2    y

In [21]:
df10 = pd.merge(df7,df8,left_on='key1',right_on='key2',how='outer')
df10

   ds1 key1  ds2 key2
0  0.0    x  NaN  NaN
1  4.0    x  NaN  NaN
2  5.0    x  NaN  NaN
3  1.0    z  3.0    z
4  3.0    z  3.0    z
5  2.0    y  2.0    y
6  NaN  NaN  1.0    q

In [22]:
df11 = pd.merge(df7,df8,left_on='key1',right_on='key2',how='left')
df11    #left side ki puri value aur right side ki common values

   ds1 key1  ds2 key2
0    0    x  NaN  NaN
1    1    z  3.0    z
2    2    y  2.0    y
3    3    z  3.0    z
4    4    x  NaN  NaN
5    5    x  NaN  NaN

In [23]:
df12 = pd.merge(df7,df8,left_on='key1',right_on='key2',how='right')
df12   #right side ki puri value aur left side ki common values

   ds1 key1  ds2 key2
0  NaN  NaN    1    q
1  2.0    y    2    y
2  1.0    z    3    z
3  3.0    z    3    z

In [25]:
a = pd.DataFrame({'data' : [0,1,2,3,4], 'key' : ['x','y','z','x','y']})
a

   data key
0     0   x
1     1   y
2     2   z
3     3   x
4     4   y

In [36]:
b = pd.DataFrame({'groupdata':[10,20]},index = list('xy'))
b

   groupdata
x         10
y         20

In [30]:
c=pd.merge(a,b,left_on='key',right_index=True)
c   #merging on the basis of the particular column and index

   data key  groupdata
0     0   x         10
3     3   x         10
1     1   y         20
4     4   y         20

In [32]:
d = pd.DataFrame({'ds1' : [0,1,2,3,4,5], 'key' : ['x','z','y','z','x','x']})
d

   ds1 key
0    0   x
1    1   z
2    2   y
3    3   z
4    4   x
5    5   x

In [34]:
e = pd.DataFrame({'ds2' : [1,2,3], 'key' : ['q','y','z']})
e

   ds2 key
0    1   q
1    2   y
2    3   z

In [36]:
pd.merge(d,e) #it merge the 2 dataframe
#merge on the basis of common column i.e key (key is present in both dataframe)

   ds1 key  ds2
0    1   z    3
1    3   z    3
2    2   y    2

In [38]:
pd.merge(d,e,on='key') #on - decide the wheather which particular column we  have to choose for merging.

   ds1 key  ds2
0    1   z    3
1    3   z    3
2    2   y    2

In [40]:
pd.merge(d,e,on='key',how='left') #left merging 
#it gives all the values of left dataframe

   ds1 key  ds2
0    0   x  NaN
1    1   z  3.0
2    2   y  2.0
3    3   z  3.0
4    4   x  NaN
5    5   x  NaN

In [41]:
pd.merge(d,e,on='key',how='right')

   ds1 key  ds2
0  NaN   q    1
1  2.0   y    2
2  1.0   z    3
3  3.0   z    3

In [42]:
pd.merge(d,e,on='key',how='outer')

   ds1 key  ds2
0  0.0   x  NaN
1  4.0   x  NaN
2  5.0   x  NaN
3  1.0   z  3.0
4  3.0   z  3.0
5  2.0   y  2.0
6  NaN   q  1.0

In [2]:
dict3 = {'id' : [1,2,3,4],'name' : ['sanket', 'rushabh','pratik','jay']}
dd =pd.DataFrame(dict3)
dd

   id     name
0   1   sanket
1   2  rushabh
2   3   pratik
3   4      jay

In [6]:
dict4 = {'id' : [1,3,5],'salary' : [10,20,50]}
ee = pd.DataFrame(dict4)
ee

   id  salary
0   1      10
1   3      20
2   5      50

In [12]:
pd.merge(dd,ee,on='id',how = 'inner')

   id    name  salary
0   1  sanket      10
1   3  pratik      20

In [9]:
pd.merge(dd,ee,on='id',how='right')

   id    name  salary
0   1  sanket      10
1   3  pratik      20
2   5     NaN      50

In [10]:
pd.merge(dd,ee,on='id',how='left')

   id     name  salary
0   1   sanket    10.0
1   2  rushabh     NaN
2   3   pratik    20.0
3   4      jay     NaN

In [11]:
pd.merge(dd,ee,on='id',how='outer')

   id     name  salary
0   1   sanket    10.0
1   2  rushabh     NaN
2   3   pratik    20.0
3   4      jay     NaN
4   5      NaN    50.0

In [2]:
dict1 = {'key1': ['sf', 'sf', 'la'], 'key2': ['one', 'two', 'one'], 'leftdata': [10, 20, 30]}
nn = pd.DataFrame(dict1)
nn

  key1 key2  leftdata
0   sf  one        10
1   sf  two        20
2   la  one        30

In [3]:
dict2 = {'key1': ['sf', 'sf', 'la', 'la'], 'key2': ['one', 'one', 'one', 'two'], 'rightdata': [40, 50, 60, 70]}
mm = pd.DataFrame(dict2)
mm

  key1 key2  rightdata
0   sf  one         40
1   sf  one         50
2   la  one         60
3   la  two         70

# Groupby

In [2]:
dict5 = {'id' : [1,2,3,4,5], 'department' : ['sales','marketing','marketing','sales','product'],'salary' : [10,30,20,15,35]}
ff = pd.DataFrame(dict5)
ff

   id department  salary
0   1      sales      10
1   2  marketing      30
2   3  marketing      20
3   4      sales      15
4   5    product      35

In [3]:
ff.groupby('department')['salary'].max()

department
marketing    30
product      35
sales        15
Name: salary, dtype: int64

In [4]:
ff.groupby('department')['salary'].min()

department
marketing    20
product      35
sales        10
Name: salary, dtype: int64

In [5]:
ff.groupby('department')['salary'].mean()

department
marketing    25.0
product      35.0
sales        12.5
Name: salary, dtype: float64

In [6]:
ff.groupby('department')['salary'].median()

department
marketing    25.0
product      35.0
sales        12.5
Name: salary, dtype: float64

In [7]:
ff['department']

0        sales
1    marketing
2    marketing
3        sales
4      product
Name: department, dtype: object

In [8]:
s1=ff['department']

In [9]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
s1.values

array(['sales', 'marketing', 'marketing', 'sales', 'product'],
      dtype=object)

grab by logic

In [11]:
ff[ff['salary']>20]

   id department  salary
1   2  marketing      30
4   5    product      35

In [12]:
ff[ff['department'] == 'marketing']

   id department  salary
1   2  marketing      30
2   3  marketing      20

In [14]:
dict5 = {'id' : [1,2,3,4,5], 'department' : ['sales','marketing','marketing','sales','product'],'salary' : [10,30,20,15,35]}
ff = pd.DataFrame(dict5)
ff

   id department  salary
0   1      sales      10
1   2  marketing      30
2   3  marketing      20
3   4      sales      15
4   5    product      35

In [30]:
ff.groupby('department')['salary'].max()

department
marketing    30
product      35
sales        15
Name: salary, dtype: int64

In [25]:
ff

   id department  salary
0   1      sales      10
1   2  marketing      30
2   3  marketing      20
3   4      sales      15
4   5    product      35

In [31]:
ff.groupby(['department','id'])['salary'].max()

department  id
marketing   2     30
            3     20
product     5     35
sales       1     10
            4     15
Name: salary, dtype: int64

In [33]:
ff[ff['department'] == 'marketing'].count()

id            2
department    2
salary        2
dtype: int64

In [40]:
z=pd.Series(np.random.randint(20,50,10))
z  #using random function in series to get random values from 20 to 50 and to get

0    36
1    28
2    39
3    43
4    44
5    33
6    40
7    45
8    28
9    21
dtype: int32

# sorting

In [42]:
z.sort_values() #it gives ascending value

9    21
1    28
8    28
5    33
0    36
2    39
6    40
3    43
4    44
7    45
dtype: int32

In [44]:
z.sort_values(ascending = False) #it give descending values

7    45
4    44
3    43
6    40
2    39
0    36
5    33
1    28
8    28
9    21
dtype: int32

In [45]:
z.sort_index() #it gives index in the ascending order

0    36
1    28
2    39
3    43
4    44
5    33
6    40
7    45
8    28
9    21
dtype: int32

# MAP FUNCTION

In [49]:
a=pd.DataFrame({'names' : ['rashmi','ganesh','palash'],'weight' : [40,50,100]})
a

    names  weight
0  rashmi      40
1  ganesh      50
2  palash     100

In [46]:
height_map = {'ganesh' : 5.8, 'palash' : 5.9, 'rashmi' : 5.5}
height_map

{'ganesh': 5.8, 'palash': 5.9, 'rashmi': 5.5}

In [53]:
a['height'] = a['names'].map(height_map)  #map function
a #for adding new colim in the dataframe

    names  weight  height
0  rashmi      40     5.5
1  ganesh      50     5.8
2  palash     100     5.9

# pivot function

In [4]:
a=np.random.randn(12)  #using random.rand values for dataframe
a

array([ 0.85512939, -0.78785424, -0.07490142, -0.38070754, -0.8076966 ,
       -0.34313608,  0.69840785, -0.49757616, -1.31681057, -1.41321554,
       -0.14213581,  0.35225279])

In [6]:
dict1 = {'data' : [1,2,3]*4,'values' : a,'variable' : list('aaabbbcccddd')}
dict1 #using a for random value and using list functino for getting the values of a

{'data': [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3],
 'values': array([ 0.85512939, -0.78785424, -0.07490142, -0.38070754, -0.8076966 ,
        -0.34313608,  0.69840785, -0.49757616, -1.31681057, -1.41321554,
        -0.14213581,  0.35225279]),
 'variable': ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'c', 'd', 'd', 'd']}

In [7]:
ss= pd.DataFrame(dict1)

In [8]:
ss

    data    values variable
0      1  0.855129        a
1      2 -0.787854        a
2      3 -0.074901        a
3      1 -0.380708        b
4      2 -0.807697        b
5      3 -0.343136        b
6      1  0.698408        c
7      2 -0.497576        c
8      3 -1.316811        c
9      1 -1.413216        d
10     2 -0.142136        d
11     3  0.352253        d

In [11]:
ss.columns

Index(['data', 'values', 'variable'], dtype='object')

In [14]:
ss.pivot(index = 'data',columns='variable',values='values')

variable         a         b         c         d
data
1         0.855129 -0.380708  0.698408 -1.413216
2        -0.787854 -0.807697 -0.497576 -0.142136
3        -0.074901 -0.343136 -1.316811  0.352253

In [19]:
fg =pd.DataFrame({'key1' : ['a','a','b','b','b'],'key2' :[ 2,2,2,3,3]})

In [20]:
fg

  key1  key2
0    a     2
1    a     2
2    b     2
3    b     3
4    b     3

# duplicated function

duplicated function : 
    check the first value which is unique gives false and check the down value and if the upper is same the gives true and 
    if the upper is not same then false

In [21]:
fg.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [24]:
fg.drop_duplicates()

  key1  key2
0    a     2
2    b     2
3    b     3

In [22]:
fg['key1'].duplicated()

0    False
1     True
2    False
3     True
4     True
Name: key1, dtype: bool

In [26]:
fg.drop_duplicates(['key1'])

  key1  key2
0    a     2
2    b     2

In [27]:
fg.drop_duplicates(['key1'],keep = 'last') #it check from down to upward

  key1  key2
1    a     2
4    b     3

In [28]:
fg['key1'].value_counts() #it gives total count of the value of specific column

key1
b    3
a    2
Name: count, dtype: int64

In [34]:
cf = pd.DataFrame({'Name' : ['om','simran','sahil','raju'], 'Age' : [21,20,np.nan,22], 'salary' : [90000,95000,np.nan,60000]},index = ['emp1','emp2','emp3','emp4'])

In [35]:
cf

        Name   Age   salary
emp1      om  21.0  90000.0
emp2  simran  20.0  95000.0
emp3   sahil   NaN      NaN
emp4    raju  22.0  60000.0

In [39]:
cf.reset_index() #make old index as a column and make the new as always

  index    Name   Age   salary
0  emp1      om  21.0  90000.0
1  emp2  simran  20.0  95000.0
2  emp3   sahil   NaN      NaN
3  emp4    raju  22.0  60000.0

In [42]:
cf.reset_index(drop=True) #drop the index

     Name   Age   salary
0      om  21.0  90000.0
1  simran  20.0  95000.0
2   sahil   NaN      NaN
3    raju  22.0  60000.0

# rename function

In [43]:
cf.reset_index().rename(columns = {'index' : 'ID'})

     ID    Name   Age   salary
0  emp1      om  21.0  90000.0
1  emp2  simran  20.0  95000.0
2  emp3   sahil   NaN      NaN
3  emp4    raju  22.0  60000.0

In [45]:
cf.index = pd.RangeIndex(start = 101,stop = 101+len(cf),step=1)   #to change the index value
cf

       Name   Age   salary
101      om  21.0  90000.0
102  simran  20.0  95000.0
103   sahil   NaN      NaN
104    raju  22.0  60000.0

In [47]:
cf.set_index('Name') #to make thename column into index

         Age   salary
Name
om      21.0  90000.0
simran  20.0  95000.0
sahil    NaN      NaN
raju    22.0  60000.0

In [49]:
cf.set_index(['Name','Age']) #multiple value on index

              salary
Name   Age
om     21.0  90000.0
simran 20.0  95000.0
sahil  NaN       NaN
raju   22.0  60000.0